# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#Пример:
#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]



spisok = input('Ввведите элементы списка через пробел').split()
i = 0
while(i < len(spisok)//2 + len(spisok)%2):
    numb = len(spisok) - i - 1
    print(int(spisok[i]) * int(spisok[numb]), end = " " )
    i+=1
    